Tekla Open API Reference for Tekla Structures 2025
StructuresExtender.SetAttributeTypeName Method
 Associates the AttributeTypeName text with the specified control.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SetAttributeTypeName(
	Control control,
	string value
)
Public Sub SetAttributeTypeName (
	control As Control,
	value As String
)
Parameters
control
Type: System.Windows.Forms.Control
The control to associate the AttributeTypeName text with.
value
Type: System.String
The AttributeTypeName text to associate with the control.
See Also
Reference
StructuresExtender Class
Tekla.Structures.Dialog Namespace